Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: ཆོས་ཐམས་ཅད་ཏིང་ངེ་འཛིན་གྱི་སྒོར་ཡོངས་སུ་སྟོན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དྲི་བ་དང་ཐེ་ཙོམ་རྒྱ་མཚོ་རྣམ་པར་སེལ་བས་ཤེས་རབ་ཀྱི་ཡུལ་ཡོངས་སུ་སྟོན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལྟ་བའི་རི་ཤིན་ཏུ་འཇོམས་པའི་ཤེས་རབ་རྡོ་རྗེ་ཡོངས་སུ་སྟོན་པ་དང་། སེམས་ཀྱི་སྐད་ཅིག་གཅིག་དང་ལྡན་པས། སེམས་ཅན་ཐམས་ཅད་ཀྱི་མ་རིག་པའི་མུན་པ་རྣམ་པར་སེལ་བའི་ཤེས་རབ་ཀྱི་ཉི་མའི་དཀྱིལ་འཁོར་འཆར་བ་ཡོངས་སུ་སྟོན་པ་བྱེད་ཅིང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དགའ་བ་ཡོངས་སུ་སྐྱེ་བར་བྱ་བས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་། །
en: He saw, issuing forth from all her pores, clouds of various bodies resembling all bodies that appear, in order to appear in accordance with the wishes of all beings within all realms, demonstrating unwearyingly going into the presence of kalyāṇamitras; demonstrating unwearying service and attendance to ācāryas, gurus, and kalyāṇamitras; demonstrating the diligence that never wearies of receiving and holding the turning of the Dharma wheel of all the tathāgatas; describing the way of comprehending the ocean of all the buddhas; contemplating the ocean of all Dharma entrances; explaining the characteristics, natures, and ways of all Dharmas; teaching the entrances into the samādhis of all Dharmas; teaching the range of wisdom that dispels the ocean of questions and doubts of all beings; teaching the vajra of wisdom that destroys the mountains of wrong views of all beings; teaching, with every instant of mind, the rising of the disk of the sun of wisdom that dispels the darkness of the ignorance of all beings; and ripening beings by bringing happiness to all beings.

source: བ་སྤུའི་སྒོ་ཐམས་ཅད་ནས་ཁ་དོག་དང་དབྱིབས་བསམ་གྱིས་མི་ཁྱབ་པའི་ལུས་མང་པོ་འགྲོ་བ་ཐམས་ཅད་དང་མཉམ་པའི་སྤྲུལ་པའི་སྤྲིན་འཐོན་ཏེ་བསམ་པ་དང་མོས་པ་ཇི་ལྟ་བ་བཞིན་དུ་སེམས་ཅན་ཐམས་ཅད་ལ་མངོན་དུ་གནས་ཤིང་། སྒྲ་སྐད་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་སྦྱང་བའི་བསྟན་པས་འཇིག་རྟེན་པའི་བསོད་ནམས་དང་བསོད་ནམས་མ་ཡིན་པ་མངོན་པར་སྟོན་པ་དང་། འཇིག་རྟེན་པའི་བྱ་བ་ཐམས་ཅད་རབ་ཏུ་རྒྱུ་བ་དང་ཁམས་གསུམ་པ་འབྱུང་བ་ཐམས་ཅད་ཡོངས་སུ་བསྟན་པ་དང་། ཁམས་གསུམ་པ་ཐམས་ཅད་ལས་འབྱུང་བའི་ཕྱོགས་ཡང་དག་པར་བརྗོད་པ་དང་། ལྟ་བའི་མྱ་ངན་མི་བཟད་པ་ཐམས་ཅད་ལས་འབྱུང་བའི་ཕྱོགས་ཡང་དག་པར་བསྟན་པས།
en: He saw, issuing forth from all her pores, clouds of emanations of many bodies of inconceivable colors and shapes, equal to those of all beings, becoming present before all beings in accordance with their motivations and aspirations, and teaching, giving instructions by having mastered various languages, the knowledge of what is meritorious in the world and what is not meritorious.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ལམ་གྱི་ཁྱད་པར་ཡོངས་སུ་བརྗོད་པ་དང་། ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་སའི་ལམ་ལས་ཡོངས་སུ་བཟླ་བ་ཡང་དག་པར་སྟོན་པ་དང་། རིམ་གྲོར་བྱས་པ་དང་། རིམ་གྲོར་མ་བྱས་པ་ལ་བྱམས་སྡང་གིས་གོས་པ་མེད་པར་ཡོངས་སུ་སྟོན་པ་དང་། འཁོར་བ་དང་མྱ་ངན་ལས་འདས་པའི་སྒོ་ལ་མི་གནས་པ་ཡང་དག་པར་སྟོན་པ་དང་། དགའ་ལྡན་གྱི་གནས་ལ་སྩོགས་པ་གཅིག་ནས་གཅིག་ཏུ་རྒྱུ་བ་རྒྱུན་མི་འཆད་པ་ཡོངས་སུ་སྟོན་པ་དང་། སྙིང་པོ་བྱང་ཆུབ་ཏུ་སོང་ཞིང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་རྒྱུན་མི་འཆད་པ་ཡོངས་སུ་སྟོན་པ་བྱེད་ཅིང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་། །
en: He saw the worldly deeds that should be accomplished, the description of the origin of all three realms, the explanation of the direction that leads to leaving all three realms, the teaching of the direction that leads to leaving the unendurable misery of wrong views, and thereby the teaching of the unique path to omniscience, the teaching of the transcending of the path of the śrāvaka and pratyeka­buddha levels, the teaching of being unstained by anger or love toward those who show respect and those who disrespect, the teaching of nonengagement with the gateways to either saṃsāra or nirvāṇa, the teaching of the unceasing successive passage from one place to another such as the Tuṣita paradise, the teaching of the unceasing succession of going to the bodhimaṇḍa and attaining complete buddhahood, and the ripening of beings for omniscience.

source: བ་སྤུའི་སྒོ་ཐམས་ཅད་ཀྱི་བ་སྤུའི་སྒོ་རེ་རེ་ནས་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་ལུས་སྤྲུལ་པའི་སྤྲིན་འཐོན་ཏེ། སེམས་ཅན་གྱི་འཇིག་རྟེན་ཐམས་ཅད་ལ་མངོན་སུམ་དུ་གནས་ཤིང་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་དང་སྨོན་ལམ་ཡོངས་སུ་བརྗོད་པ་དང་།
en: He saw, issuing forth from all her pores, clouds of emanated bodies as numerous as the atoms in all buddha realms and visibly present in all worlds of beings.

source: ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྣམ་པར་དག་པའི་མཐར་ཐུག་པའི་སྨོན་ལམ་གྱི་ཁྱད་པར་ཡོངས་སུ་བརྗོད་པ་དང་། སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་ཐམས་ཅད་ཡོངས་སུ་དག་པར་བྱ་བ་ཡོངས་སུ་བརྗོད་པ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་མཆོད་ཅིང་རིམ་གྲོར་བྱ་བ་རྒྱུན་མི་འཆད་པ་ཡོངས་སུ་བརྗོད་པ་དང་། སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཆོས་ཀྱི་ཚུལ་རྒྱ་མཚོ་ཐམས་ཅད་ལ་འཇུག་པ་རྒྱུན་མི་འཆད་པ་ཡོངས་སུ་སྟོན་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་རྒྱ་མཚོ་ལ་འཇུག་པ་རྒྱུན་མི་འཆད་པ་ཡོངས་སུ་སྟོན་པ་དང་། ཞིང་ཐམས་ཅད་དུ་ཕྱི་མའི་མཐའི་བསྐལ་པའི་མུར་ཐུག་པར་གནས་ཤིང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ལམ་རྣམ་པར་དག་པར་བྱ་བ་ཡོངས་སུ་བརྗོད་པ་རྒྱུན་མི་འཆད་པ་ཡང་དག་པར་སྟོན་པ་དང་། སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་དེ་བཞིན་གཤེགས་པའི་སྟོབས་ལ་འཇུག་པ་རྒྱུན་མི་འཆད་པ་ཡང་དག་པར་བརྗོད་པ་དང་། དུས་གསུམ་གྱི་ཚུལ་རྒྱ་མཚོ་ཐམས་ཅད་ལ་འཇུག་པ་རྒྱུན་མི་འཆད་པ་ཡོངས་སུ་སྟོན་པ་དང་། ཞིང་ཐམས་ཅད་དུ་རྫུ་འཕྲུལ་གྱི་རྣམ་པར་འཕྲུལ་པ་ཡོངས་སུ་བསྟན་པ་རྒྱུན་མི་འཆད་པ་ཡང་དག་པར་སྟོན་པ་བྱེད་ཅིང་། བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་དང་། སྤྱོད་པ་ཡོངས་སུ་བསྟན་པས་སེམས་ཅན་ཐམས་ཅད་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་རབ་ཏུ་འགོད་པ་མཐོང་ངོ་། །བ་སྤུའི་སྒོ་ཐམས་ཅད་ཀྱི་བ་སྤུའི་སྒོ་རེ་རེ་ནས་ཀྱང་འགྲོ་བ་ཐམས་ཅད་ཀྱི་སེམས་དང་མཉམ་པའི་ལུས་ཀྱི་སྤྲུལ་པའི་སྤྲིན་མང་པོ་འཐོན་ཏེ། སེམས་ཅན་ཐམས་ཅད་ལ་མངོན་པར་གནས་ཤིང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཚོགས་ཀྱི་སྟོབས་མུ་མེད་པ་ཡོངས་སུ་སྟོན་པ་དང་། ཐམས་ཅད་མཁྱེན་པའི་སེམས་ཀྱི་སྟོབས་མི་ཟད་པ་དང་། མི་འཇིགས་པ་དང་། ཆུད་མི་ཟ་བའི་ཆོས་ཅན་ཡོངས་སུ་སྟོན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་ཡོངས་སུ་སྒྲུབ་པའི་སྟོབས་ཕྱིར་མི་ལྡོག་ཅིང་ཕྱིར་མི་ཟློག་ཐུབ་པ་མེད་པ་དང་། རྒྱུན་མེད་པ་དང་། བླ་ན་མེད་པ་ཡོངས་སུ་སྟོན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྟོབས་འཁོར་བའི་ཉེས་པ་ཐམས་ཅད་ཀྱིས་མི་གོས་པ་ཡོངས་སུ་སྟོན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྟོབས་བདུད་ཀྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་རྣམ་པར་འཐོར་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྟོབས་ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱི་དྲི་མས་ཉེ་བར་ཉོན་མོངས་པ་མེད་པ་ཡོངས་སུ་སྟོན་པ་དང་། །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྟོབས་ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་ཀྱི་རི་རྣམ་པ་འཐོར་བ་ཡོངས་སུ་སྟོན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྙིང་རྗེ་ཆེན་པོའི་སྟོབས་བསྐལ་པ་ཐམས་ཅད་དུ་གནས་ཀྱང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པས་སྐྱོབ་མེད་པ་ཡོངས་སུ་སྟོན་པ་དང་།
en: They were describing the completely good bodhisattva conduct and prayer; describing the special prayer for the perfect purification of the entire realm of phenomena; describing the purification of the entire ocean of world realms in each instant of mind; describing continuous service and offering to all the tathāgatas; teaching the continuous entry into the ocean of all the ways of the Dharma in each instant of mind; describing the continuous entry into the ocean of the ways of the realm of phenomena, which are as numerous as the atoms in the entire ocean of world realms, in each instant of mind; describing the continuous teaching of the purification of the path to omniscience while remaining resolutely throughout all future kalpas in all realms; describing continuous entry into the strengths of the tathāgatas in each instant of mind; teaching continuous entry into the ocean of all the ways of the three times; teaching the continuous manifestation of miraculous powers in all realms; and establishing all beings in omniscience through the teaching of bodhisattva prayer and conduct.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྟོབས་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཡོངས་སུ་བསྐྱོད་ཅིང་བསྐུལ་བས། སེམས་ཅན་ཐམས་ཅད་རབ་ཏུ་དགའ་བར་བྱེད་པ་ཡོངས་སུ་སྟོན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྟོབས་བདུད་དང་། ཕས་ཀྱི་རྒོལ་བའི་ཚོགས་ཐམས་ཅད་རབ་ཏུ་འཇོསམ་པ་ཡོངས་སུ་སྟོན་པ་དང་། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའི་ཡེ་ཤེས་ཀྱི་སྟོབས་ཆེན་པོ་འཇིག་རྟེན་དུ་རབ་ཏུ་བརྗོད་པ་བྱེད་ཅིང་སེམས་ཅན་ཐམས་ཅད་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་། །བ་སྤུའི་སྒོ་ཐམས་ཅད་ཀྱི་བ་སྤུའི་སྒོ་རེ་རེ་ནས་ཀྱང་ལུས་ཀྱི་སྤྲུལ་པ་རྒྱ་མཚོ་ཁ་དོག་མཐའ་ཡས་པ་འགྲོ་བ་ཐམས་ཅད་ཀྱི་སེམས་དང་མཉམ་པའི་སྤྲིན་ཕྱོགས་བཅུ་མཐའ་ཡས་པའི་སེམས་ཅན་གྱི་ཁམས་སུ་རྒྱས་པར་འགེངས་པ་འཐོན་ཏེ། སེམས་ཅན་རྣམས་ཀྱི་བསམ་པ་དང་། མོས་པ་ཇི་ལྟ་བ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་དང་། ཡེ་ཤེས་ཀྱི་རྣམ་པར་གནོན་པ་ཡོངས་སུ་སྟོན་པ་དང་།
en: He saw, issuing forth from all her pores, clouds of emanated bodies as numerous as the minds of all beings, and in the presence of all beings teaching the limitless strength of the accumulation of omniscience; teaching the inexhaustible, indestructible, and everlasting strength of the mind that knows all phenomena; teaching the irreversible, nonregressive, invincible, ever-continuing, unsurpassable strength of the attainment of all bodhisattva conduct; teaching the bodhisattva strength that is unstained by any of the faults of saṃsāra; teaching the bodhisattva strength that disperses the entire army of Māra; teaching the bodhisattva strength that is unafflicted by the stains of any of the kleśas; teaching the bodhisattva strength that disperses the mountain of all karmic obscurations; teaching the bodhisattva strength of great compassion that continues throughout all kalpas with unwearying bodhisattva conduct; teaching the bodhisattva strength that brings happiness to all beings by shuddering and shaking all buddha realms; teaching the bodhisattva strength that defeats all the hosts of māras and adversaries; and elucidating in the world the great strength of the wisdom of turning the Dharma wheel and thus ripening all beings for omniscience.

source: སེམས་ཅན་གྱི་ཁམས་རྒྱ་མཚོ་ཐམས་ཅད་ལ་འཇུག་པའི་ཡེ་ཤེས་ཡོངས་སུ་སྟོན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་རྒྱ་མཚོ་ལ་འཇུག་པའི་ཡེ་ཤེས་ཡོངས་སུ་སྟོན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོ་རྒྱ་མཚོ་ཡོངས་སུ་ཤེས་པའི་ཡེ་ཤེས་ཡོངས་སུ་སྟོན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་རྒྱ་མཚོ་ལ་འཇུག་པའི་ཡེ་ཤེས་ཡོངས་སུ་སྟོན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བའི་དུས་ལས་མི་འདའ་བའི་ཡེ་ཤེས་ཡོངས་སུ་སྟོན་པ་དང་། ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་དུ་གྲགས་པར་སྒྲོག་པའི་ཡེ་ཤེས་ཡོངས་སུ་སྟོན་པ་དང་། སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་དུ་ཡེ་ཤེས་ཀྱི་ཚུལ་རྒྱ་མཚོས་རྒྱས་པར་འགེངས་བའི་ཡེ་ཤེས་ཡོངས་སུ་སྟོན་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་ཐམས་ཅད་འདུ་བ་དང་། འཇིག་པའི་ཡེ་ཤེས་ཡོངས་སུ་སྟོན་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་གཞི་དང་དབྱིབས་དང་། རྒྱན་རྣམ་པར་དགོད་པའི་ཡེ་ཤེས་ཡོངས་སུ་སྟོན་པ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་མཆོད་པ་རྣམ་པར་སྤྲུལ་ཏེ། སྤྱན་སྔར་ཕྱིན་ནས། མཆོད་ཅིང་རིམ་གྲོར་བྱེད་པ་དང་། ཆོས་ཀྱི་འཁོར་ལོའི་སྤྲིན་ཡང་དག་པར་འཛིན་པའི་ཡེ་ཤེས་ཡོངས་སུ་སྟོན་པ་བྱེད་ཅིང་།
en: He saw, issuing forth from all her pores, clouds of emanated bodies, as numerous as the minds of all beings, which spread throughout the infinite realms of beings in the ten directions, teaching in accordance with the motivations and aspirations of beings the prowess of bodhisattva conduct and wisdom; teaching the wisdom that comprehends the ocean of all the realms of beings; teaching the wisdom that comprehends the ocean of the minds of all beings; teaching the wisdom that knows the ocean of the faculties of all beings; teaching the wisdom that comprehends the ocean of the conducts of all beings; teaching the wisdom that always knows the time for ripening and guiding all beings; teaching the wisdom that resounds throughout the entire realm of phenomena; teaching the wisdom that pervades everywhere, in each instant of mind, the ocean of all the ways of knowing the entire realm of phenomena; teaching the knowledge of the formation and destruction of the ocean of all world realms; teaching the knowledge of the basis, shape, and arrayed displays of all world realms; and teaching the knowledge of emanating offerings to all the tathāgatas, going into their presence, making offerings, rendering service, and possessing clouds of Dharma wheels.

source: དེ་ལྟར་ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྤྱོད་པ་ཡོངས་སུ་སྟོན་པས་སེམས་ཅན་རྣམས་ཀྱི་དགའ་བསྐྱེད་པ་དང་། སེམས་རབ་ཏུ་དང་བར་བྱེད་པ་དང་། རབ་ཏུ་དགའ་བ་སྐྱེད་པ་དང་། མོས་པ་འཕེལ་བར་བྱེད་པ་དང་། ཡིད་མི་བདེ་བ་རྣམ་པར་ཟློག་པ་དང་། སེམས་རྣམ་པར་སྤྱོད་པ་དང་། སེམས་སྐྱོན་མེད་པར་སྐྱེ་བར་བྱེད་པ་དང་། དབང་པོ་གསལ་བར་བྱེད་པ་དང་། མོས་པའི་སྟོབས་ཡོངས་སུ་སྐྱེད་པ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལས་ཕྱིར་མི་ལྡོག་པར་བྱེད་པ་མཐོང་ངོ་། །ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྤྱོད་པ་ཡོངས་སུ་བསྟན་པས་འཇིག་རྟེན་དུ་ཅི་ལྟར་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་གྱུར་པ་མཐོང་བ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཐམས་ཅད་རབ་ཏུ་སྒྲོག་པའི་ཚུལ་གྱིས་མཚན་མོའི་ལྷ་མོར་རབ་ཏུ་དགའ་བའི་མིག་འཕྲོ་བར་རྣམ་པར་སྣང་བའི་ཐོག་མ་སེམས་བསྐྱེད་པའི་ཚོགས་དང་། དགེ་བའི་བཤེས་གཉེན་བསྙེན་བཀུར་བའི་ཐབས་དང་། དེ་བཞིན་གཤེགས་པའི་ཞབས་ཀྱི་དྲུང་དུ་ཕྱིན་ཅིང་མཆོད་པ་དང་། རིམ་གྲོ་བྱས་པའི་ཚུལ་དང་། དགེ་བའི་ཆོས་སྤྱད་པའི་ཐབས་ཇི་སྙེད་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྤྱོད་པས་གཏང་བར་དཀའ་བ་ཡོངས་སུ་གཏོང་བ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་སྦྱང་བའི་ཐབས་དང་། རྒྱལ་སྲིད་ཀྱི་དབང་ཕྱུག་ཆེན་པོ་དང་། འཁོར་མང་པོ་དང་། ལོངས་སྤྱོད་ཀྱི་དབང་ཆེན་པོ་ཡོངས་སུ་བཏང་སྟེ། མངོན་པར་འབྱུང་བའི་ཐབས་ཇི་སྙེད་པ་དང་། འཇིག་རྟེན་གྱི་དཀའ་བའི་སྤྱོད་པ་བརྟུལ་ཞུགས་དང་དཀའ་ཐུབ་ཆེན་པོའི་དཀྱིལ་འཁོར་ལ་བཟོད་པ་མངོན་པར་བསྒྲུབས་པ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་བརྟུལ་ཞུགས་ཡང་དག་པར་བླང་བའི་སྦྱོར་བ་ལ་མི་གཡོ་བར་བྱ་བ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཡི་དམ་བརྟན་པའི་ཆོས་རྒྱ་མཚོ་སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་ཉེས་བྱས་དང་། ངན་དུ་སྨྲ་བ་དང་། ཉེས་པར་སྤྱོད་པ་ཐམས་ཅད་བག་ལ་ཞ་བར་བྱེད་པའི་སྦྱོར་བ་དང་། ལུས་དང་སེམས་ཀྱི་གནོད་པ་ཉམས་སུ་བཟོད་པར་བྱེད་པའི་སྦྱོར་བ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། ཆོས་ཐམས་ཅད་འཇིག་པ་མེད་པའི་ཆོས་ཉིད་ལ་བཟོད་པ་དང་། ཆོས་ཐམས་ཅད་ལ་ཡིད་ཆེས་པའི་བཟོད་པ་དང་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་ངེས་པར་རྟོགས་པའི་བཟོད་པ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་རྩོམ་ཞིང་སྦྱོར་བའི་བརྩོན་འགྲུས་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་སྒྲུབ་པའི་བརྩོན་འགྲུས་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྤྱོད་པ་ཇི་སྙེད་པ་ཐམས་ཅད་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཚོགས་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་པར་བྱ་བ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་བསྒྲུབ་པ་རྣམ་པར་དག་པའི་སྤྱོད་པ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་རབ་ཏུ་ཐོབ་པས།
en: And by teaching in that way the practice of the perfection of knowledge, they were bringing happiness to beings, making their minds clear, creating joy, increasing aspiration, dispelling unhappiness, purifying the mind, creating a faultless mind, clarifying the senses, creating the power of aspiration, and causing irreversible progress toward omniscience.

source: རྣམ་པར་འཕྲུལ་བ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། ཏིང་ངེ་འཛིན་གྱི་སྒོ་རྒྱ་མཚོ་ལ་འཇུག་པ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྤྱོད་པ་ཇི་སྙེད་པ་ཐམས་ཅད་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཚོགས་ཇི་སྙེད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཤེས་རབ་ཆེན་པོའི་ཉི་མའི་དཀྱིལ་འཁོར་རྣམ་པར་སྦྱང་བའི་ཚུལ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། ཤེས་རབ་ཆེན་པོའི་སྤྲིན་ཡོངས་སུ་འདུ་བའི་ཚུལ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། ཤེས་རབ་ཀྱི་གཏེར་ཆེན་པོའི་ཚོགས་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། ཤེས་རབ་ཀྱི་རྒྱ་མཚོ་ཆེན་པོ་ལ་རྣམ་པར་དཔྱད་པའི་ཚུལ་དང་། སྦྱོར་བ་ཇི་སྙེད་པ་ཐམས་ཅད་དང་། ཐབས་ཆེན་པོ་ལ་མཁས་པའི་ཚུལ་གྱི་སྦྱོར་བ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། ཐབས་ཆེན་པོ་ལ་མཁས་པ་ཡོངས་སུ་དག་བར་བྱ་བ་དང་ལྡན་པའི་སྔོན་གྱི་སྦྱོར་བ་ཇི་སྙེད་པ་ཐམས་ཅད་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལུས་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་སྨོན་ལམ་ཆེན་པོའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་གྲུབ་པ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། སྨོན་ལམ་ཆེན་པོའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྤྱོད་པ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། སྨོན་ལམ་ཆེན་པོའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་ལྡན་པའི་སྔོན་གྱི། སྦྱོར་བ་ཇི་སྙེད་པ་ཐམས་ཅད་དང་། སྟོབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐོབ་པར་བྱ་བའི་ཚོགས་ཆེན་པོ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། སྟོབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྐྱེན་དུ་གྱུར་པ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། སྟོབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཚུལ་རྒྱ་མཚོ་ཆེན་པོ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། སྟོབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཤིན་ཏུ་བསྟན་པ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། སྟོབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་ལྡན་པའི་སྔོན་གྱི་སྦྱོར་བ་ཇི་སྙེད་པ་ཐམས་ཅད་དང་། ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྦྱོར་བ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པར་དག་པའི་ཚུལ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཕྱོགས་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྗེས་སུ་འབྲང་བར་བྱ་བ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འབྱམ་ཀླས་པ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཚུལ་ལ་ཡང་དག་པར་གཞོལ་བར་བྱ་བ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཚུལ་རྣམ་པར་དམིགས་པར་བྱ་བ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འབྱམ་ཀླས་པའི་རྗེས་སུ་འབྲང་བར་བྱ་བ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་རྒྱས་པར་འགེངས་པ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྒྱ་ཆེན་པོ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལྷུན་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་འགྲུབ་པར་བྱ་བ་དང་ལྡན་པའི་སྔོན་གྱི་སྦྱོར་བ་ཇི་སྙེད་པ་ཐམས་ཅད་དང་། ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྤྱོད་པའི་རྣམ་པར་རབ་ཏུ་ཕྱེ་བ་ལ་འཇུག་པ་འབྱུང་བ་ཡོངས་སུ་བསྒྲུབ་པ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཡང་དག་པར་གཞོལ་བར་བྱ་བའི་ཚུལ་དང་ལྡན་པའི་ཆོས་རྣམས་དང་། ཆོས་ཡོངས་སུ་བསྡུ་བ་དང་། ཆོས་ཀྱི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། ལས་ཀྱི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། ཞིང་གི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། བསྐལ་པའི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། དུས་ཀྱི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། སངས་རྒྱས་འབྱུང་བའི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སེམས་ཡོངས་སུ་འབྱུང་བའི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་དགོད་པའི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་འབྱུང་བའི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རབ་ཏུ་འཇུག་པའི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་གྱི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཀྱི་འཁོར་ལོའི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་རྣམ་པར་འབྱེད་པའི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་རྒྱ་མཚོའི་ཚུལ་གྱི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་གང་ཆེན་མཚོའི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཀྱི་རྒྱུད་ཀྱི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཀྱི་གཏེར་གྱི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཀྱི་ལུགས་ཀྱི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་།
en: In the same way that he saw beings being ripened in worlds through the teaching of the practice of the perfections, he saw the night goddess Pramudita­nayana­jagad­virocanā proclaiming all the bodhisattva Dharmas: the initial accumulation of developed motivation; the methods for serving and venerating kalyāṇamitras; approaching the feet of tathāgatas and making offerings to them and attending them; every method for practicing good qualities; making the most difficult of gifts through the practice of the perfection of generosity; the methods for training in the perfection of correct conduct; all the methods for giving up the great power of kingship, retinues, and great power over enjoyments and becoming a renunciate; all the accomplishments of patience in the domain of vows of discipline and great asceticism that are difficult to undertake in this world; all resolute engagement in the bodhisattva vows of discipline; the ocean of the qualities of firm bodhisattva commitments; the endurance of the bad actions, bad speech, and bad thoughts of all realms of beings; the endurance of harm to the body and the mind; the patience of the nonperishing nature of the Dharma; the patience of belief in all Dharmas; the patience of realizing the nature of the Dharma; the diligence for engaging in undertaking omniscience; the diligence for accomplishing all the qualities of buddhahood; the practice of the perfection of diligence; the accumulation of the perfection of meditation; dedication to the perfection of meditation; the pure practices that accomplish the perfection of meditation; the miraculous powers from the attainment of bodhisattva samādhis; the entry through an ocean of samādhi gateways; the practices of the perfection of meditation; the accumulation of the perfection of wisdom; the ways of purifying the sun disk of great bodhisattva wisdom; the ways of accumulating the clouds of great wisdom; the accumulations of the great treasure of wisdom; the ways of analyzing the great ocean of wisdom; dedication to purification and skill in great methods; the bodies from the perfection of great bodhisattva prayers; the accomplishment of the perfection of great prayers; the practice of the perfection of great prayers; the dedication in the past to the perfection of great prayers; the great accumulations for attaining the perfection of strength; the conditions for the perfection of strength; the great ocean of the ways of the perfection of strength; the teaching of the perfection of strength; the dedication in the past to the perfection of strength; the practice of the perfection of knowledge; the ways of the perfection of knowledge; the ways of the purification of the perfection of knowledge; the direction of the perfection of knowledge; following the perfection of knowledge; the vastness of the perfection of knowledge; absorption in the ways of the perfection of knowledge; focusing on the ways of the perfection of knowledge; following the vastness of the perfection of knowledge; the pervasion of the perfection of knowledge; the extent of the perfection of knowledge; the assemblage of the perfection of knowledge; dedication in the past to the accomplishment of the perfection of knowledge; the arrangement of the arising of entry into the classification of the kinds of practice of the perfection of knowledge; possessing the ways of absorption in the perfection of knowledge; seeking the knowledge of Dharma that encompasses what is Dharma and what is not Dharma; seeking the knowledge of karma; seeking the knowledge of realms; seeking the knowledge of kalpas; seeking the knowledge of times; seeking the knowledge of the occurrence of buddhas; seeking the knowledge of buddhas; seeking the knowledge of the bodhisattvas; seeking the knowledge of the arising of bodhisattva motivation; seeking the knowledge of the presence of bodhisattvas; seeking the knowledge of the arising of bodhisattvas; seeking the knowledge of the setting-forth of bodhisattvas; seeking the knowledge of prayers; seeking the knowledge of the Dharma wheels of bodhisattvas; seeking the knowledge of the analysis of the Dharma by bodhisattvas; seeking the knowledge of the ways of the sea of Dharma of the bodhisattvas; seeking the knowledge of the ocean of Dharma of the bodhisattvas; seeking the knowledge of the turning of the Dharma wheel of the bodhisattvas; seeking the knowledge of the treasure of the Dharma of the bodhisattvas; and seeking the knowledge of the state of the Dharma of the bodhisattvas.

source: མཚན་མོའི་ལྷ་མོ་རབ་ཏུ་དགའ་བའི་མིག་འགྲོ་བར་རྣམ་པར་སྣང་བའི་ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་མཐའ་དང་དབུས་མེད་པའི་དམིགས་པ་ཅན་དེ་དག་ཐམས་ཅད་དེའི་བ་སྤུའི་སྒོ་ཐམས་ཅད་ཀྱི་བ་སྤུའི་སྒོ་རེ་རེ་ནས་མངོན་པར་འཐོན་ཏེ། སེམས་ཅན་གྱི་ལུས་ཀྱི་སྤྲིན་ཁ་དོག་སྣ་ཚོགས་ཅན་དུ་མངོན་པར་མཆོད་ཅིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་། །འདི་ལྟ་སྟེ། འོག་མིན་དང་།
en: Clouds of bodies of beings of various colors emitted from each of the night goddess Pramudita­nayana­jagad­virocanā’s pores ripened beings through all the limitless and centerless bodhisattva practices endowed with the perfection of knowledge.

source: ཤིན་ཏུ་མཐོང་བ་དང་། གྱ་ནོམ་སྣང་བ་དང་། མ་དྲོས་པ་དང་། མི་ཆེ་བའི་གཙང་མའི་གནས་ཀྱི་ལྷ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་། །
en: They were like this: he saw clouds of bodies that were like those of the Śuddhāvāsa devas of the Akaniṣṭha, Sudarśana, Sudṛśa, Atapa, and Avṛha paradises issuing forth and ripening beings.

source: དེ་བཞིན་དུ་འབྲས་བུ་ཆེ་བ་དང་། བསོད་ནམས་འཕེལ་བ་དང་། སྤྲིན་དང་བྲལ་བའི་ལྷ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་། །
en: In the same way, he saw clouds of bodies that were like those of the devas in the Bṛhatphala, Puṇya­prasava, and Anabhraka paradises issuing forth and ripening beings.

source: དགེ་རྒྱས་དང་ཚད་མེད་དགེ་བ་དང་། དགེ་བ་ཆུང་བའི་ལྷ་ལྟ་བུའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཅིང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་། །
en: He saw clouds of bodies that were like those of the devas in the Śubhakṛtsna, Apramāṇa­śubha, and Parītta­śubha paradises issuing forth and ripening beings.
